let handler = async (m, { conn, command, text }) => {
let love = `
*✥━─━⌬〘🧸🥂〙⌬━─━✥*

 ֎💫╽معرف المطور ↶
                       *⋄━───═◞⬪⋇⬪◟═───━⋄*

֎✨╽قـسـم المـفـضـل ↶
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⟤ـ
┊الانـمـي - 𝐀𝐧𝐢𝐦𝐞
┊الـراب - 𝐑𝐚𝐩
┊الـبـرمـجـه - 𝐏𝐫𝐨𝐠𝐫𝐚𝐦𝐢𝐧𝐠
┊الـفـن - ♯ЅᗩFᏒOT꙯
┘┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈⟤ـ
֎⚡╽قـسـم التـعـريـف ↶
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⟤ـ
┊اهلا بك فـ بروفايلي
┊ انا ابراهيم "سفروت"
┊عمري 20 عام
┊المحافظه الجيزه
┊ليس لدي عزيز لذا لا تحاول
┘┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈⟤ـ
֎🌩️╽قـسـم الـكـره ↶
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⟤ـ
┊➊ النفاق
┊➋ الكذب
┊➌ المحن
┊➍ العند
┊➎ التكبر
┊➏ بتاع مصلحته
┊➐ الشواذ
┊➑ النرم 
┘┈┈┈┈┈┈┈┈﴿سفروت بوت﴾┈┈┈┈┈⟤ـ`.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(معرف|المعرف)$/i
export default handler
